# identity-shared - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.kafka_topic.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.database.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.kafka_topic.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=staging-kafka-cluster-id]
module.common_resources.module.database.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=staging-cockroachdb-serverless-cluster-id]
module.common_resources.module.kafka_topic.upstash_kafka_topic.default: Refreshing state... [id=upstash-kafka-topic-b6f574c5-85ad-4272-8e5b-e221b8c60a10]
module.common_resources.module.database.cockroach_database.default: Refreshing state... [id=7f49bf76-cc5f-4933-b3bc-be5dc402a617:staging-identity]
module.common_resources.module.database_migration_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.database_migration_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.database_migration_user.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=staging-cockroachdb-serverless-cluster-id]
module.common_resources.module.database_migration_user.cockroach_sql_user.default: Refreshing state... [id=7f49bf76-cc5f-4933-b3bc-be5dc402a617:staging-identity-database-migration]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.database_migration_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "staging-identity"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "staging-identity_database_migration"
    }

  # module.common_resources.module.database_migration_user.cockroach_sql_user.default must be replaced
-/+ resource "cockroach_sql_user" "default" {
      ~ id         = "7f49bf76-cc5f-4933-b3bc-be5dc402a617:staging-identity-database-migration" -> (known after apply)
      ~ name       = "staging-identity-database-migration" -> "staging-identity_database_migration" # forces replacement
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_migration_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "46f0761d-62b6-4d84-bf7a-67be33dcb43d" -> "9ac60cbd-6a76-49b4-974d-bc0651de2b82"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

  # module.common_resources.module.kafka_topic.upstash_kafka_topic.default must be replaced
-/+ resource "upstash_kafka_topic" "default" {
      ~ creation_time    = 1682593615 -> (known after apply)
      ~ id               = "upstash-kafka-topic-b6f574c5-85ad-4272-8e5b-e221b8c60a10" -> (known after apply)
      ~ multizone        = false -> (known after apply)
      ~ password         = (sensitive value)
      ~ region           = "us-east-1" -> (known after apply)
      ~ rest_endpoint    = "touched-giraffe-5986-us1-rest-kafka.upstash.io" -> (known after apply)
      ~ state            = "active" -> (known after apply)
      ~ tcp_endpoint     = "touched-giraffe-5986-us1-kafka.upstash.io" -> (known after apply)
      ~ topic_id         = "b6f574c5-85ad-4272-8e5b-e221b8c60a10" -> (known after apply)
      ~ topic_name       = "identity.v1" -> "staging.identity.v1" # forces replacement
      ~ username         = "dG91Y2hlZC1naXJhZmZlLTU5ODYkdbvx5PpbELTI2g41jqZ51KtDWMbERIh7yq4" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  ~ database_migration_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*